{
  "model_type": "phi",
  "architectures": [
    "PhiForCausalLM"
  ],
  "model_name": "microsoft/phi-2",
  "vocab_size": 51200,
  "hidden_size": 2560,
  "intermediate_size": 6912,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "max_position_embeddings": 2048,
  "context_length": 2048,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "attention_dropout": 0.0,
  "hidden_dropout": 0.0,
  "activation_function": "gelu",
  "layer_norm_epsilon": 1e-05,
  "initializer_range": 0.02,
  "use_cache": true,
  "pad_token_id": null,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.36.0"
}